benchmarks/sglang/runpod_h200sxm/gpt-oss-120b/H200_tp8_dp1_in2048_out128_p100_c100_7da261.txt
BENCHMARK: tp8_dp1_in2048_out128_p100_c100_7da261
================================================================
Command: python -m sglang.bench_serving --port 30000 --model /workspace/gpt-oss-120b --host 127.0.0.1 --backend sglang --dataset-name random --random-input-len 2048 --random-output-len 128 --num-prompts 100 --max-concurrency 100 --request-rate inf --output-file ./benchmark_results_tp8_dp1_H200/tp8_dp1_in2048_out128_p100_c100_7da261.jsonl --output-details
================================================================

benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/gpt-oss-120b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_tp8_dp1_H200/tp8_dp1_in2048_out128_p100_c100_7da261.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/gpt-oss-120b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_tp8_dp1_H200/tp8_dp1_in2048_out128_p100_c100_7da261.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 108929
#Output tokens: 6108
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:00<00:41,  2.36it/s]
  2%|▏         | 2/100 [00:03<03:06,  1.91s/it]
 14%|█▍        | 14/100 [00:03<00:15,  5.57it/s]
 22%|██▏       | 22/100 [00:03<00:08,  9.75it/s]
 32%|███▏      | 32/100 [00:03<00:04, 16.45it/s]
 40%|████      | 40/100 [00:03<00:02, 21.93it/s]
 47%|████▋     | 47/100 [00:03<00:01, 27.34it/s]
 57%|█████▋    | 57/100 [00:04<00:01, 37.51it/s]
 72%|███████▏  | 72/100 [00:04<00:00, 56.11it/s]
 85%|████████▌ | 85/100 [00:04<00:00, 66.93it/s]
 97%|█████████▋| 97/100 [00:04<00:00, 77.66it/s]
100%|██████████| 100/100 [00:04<00:00, 22.86it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     100       
Benchmark duration (s):                  4.38      
Total input tokens:                      108929    
Total input text tokens:                 108929    
Total generated tokens:                  6108      
Total generated tokens (retokenized):    6100      
Request throughput (req/s):              22.82     
Input token throughput (tok/s):          24861.63  
Output token throughput (tok/s):         1394.07   
Peak output token throughput (tok/s):    4893.00   
Peak concurrent requests:                100       
Total token throughput (tok/s):          26255.70  
Concurrency:                             87.71     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3842.85   
Median E2E Latency (ms):                 3942.34   
P90 E2E Latency (ms):                    4247.30   
P99 E2E Latency (ms):                    4341.81   
---------------Time to First Token----------------
Mean TTFT (ms):                          1015.98   
Median TTFT (ms):                        568.91    
P99 TTFT (ms):                           3291.71   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          117.26    
Median TPOT (ms):                        47.16     
P99 TPOT (ms):                           1337.07   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           47.05     
Median ITL (ms):                         9.39      
P95 ITL (ms):                            10.82     
P99 ITL (ms):                            2748.96   
Max ITL (ms):                            3101.36   
==================================================